In [23]:
import pandas as pd
import numpy as np

In [31]:
Customer_Attr = pd.read_csv("customer_data_2014-15_attr.csv")

In [32]:
Customer_Visit = pd.read_csv("customer_data_2015_visited.csv")

In [52]:
Customer_Tras = pd.read_csv("customer_data3_2015_transactions.csv")

In [53]:
Customer_Tras

         transactionID  Spends  CustomerID transactionDate
0              1000001      16      843140      2015-01-01
1              1000002      31      697698      2015-01-01
2              1000003      27      746282      2015-01-01
3              1000004      28      645145      2015-01-01
4              1000005      22      766577      2015-01-01
...                ...     ...         ...             ...
2844427        3844428      16      710852      2015-12-31
2844428        3844429      39      840213      2015-12-31
2844429        3844430      29      846884      2015-12-31
2844430        3844431      26      744646      2015-12-31
2844431        3844432      27      961948      2015-12-31

[2844432 rows x 4 columns]

In [37]:
Customer_Attr['CustomerId'].nunique()

500000

In [41]:
Customer_Visit['CustomerID'].nunique()

500000

In [44]:
Customer_Attr = Customer_Attr.rename(columns={'CustomerId': 'CustomerID'})

In [45]:
Customer_Attr

        CustomerID  Age CustomerSince Gender Region
0           500001   59          2012      F   East
1           500002   26          2013      M   East
2           500003   28          2013      F   West
3           500004   31          2015      M   West
4           500005   28          2013      F  South
...            ...  ...           ...    ...    ...
499995      999996   54          2012      M   West
499996      999997   56         <2011      F   East
499997      999998   59          2015      F   West
499998      999999   40          2015      M  South
499999     1000000   23          2012      M   East

[500000 rows x 5 columns]

In [46]:
result = pd.merge(Customer_Attr, Customer_Visit, on='CustomerID')

In [48]:
result.shape

(500000, 6)

In [51]:
Customer_Visit['CustomerID'].nunique()

500000

In [56]:
Customers = pd.merge(result, Customer_Tras, on ='CustomerID' )

In [57]:
Customers.shape

(2844432, 9)